app/views/restaurants/index.html.haml

SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 1]]
---
    = link_to "Review #{restaurant.name}", new_restaurant_review_path(restaurant)
    - restaurant.reviews.each do |review|