app/views/restaurants/show.html.erb


<% if @restaurant.reviews.any? %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 3]]