app/controllers/restaurants_controller.rb

  def create
    @restaurant = Restaurant.create(restaurant_params)
---
INSERT INTO "restaurants" ("name", "rating", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Macey's Meatballs"], ["rating", 5], ["created_at", "2016-05-26 10:23:46.981102"], ["updated_at", "2016-05-26 10:23:46.981102"]]

  def update
    @restaurant = Restaurant.find(params[:id])
    @restaurant.update(restaurant_params)
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "restaurants" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "restaurants"."id" = $4  [["name", "Kentucky Fried Chicken"], ["description", "Deep fried goodness"], ["updated_at", "2016-05-24 12:30:19.751315"], ["id", 4]]

  def destroy
    @restaurant = Restaurant.find(params[:id])
    if @restaurant.belongs_to_user?(current_user)
      @restaurant.destroy
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 9]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 9]]